tests/load/load-test-config.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 5
      rampTo: 10
      name: "Ramp up load"
    - duration: 240
      arrivalRate: 10
      name: "Sustained load"
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
      - get:
          url: "/"
      - think: 1
      - get:
          url: "/tools/image-to-excel"